<template>
    <div class="block__solution">
        <h4>15) Directive: <span>v-memo 3.2+</span></h4>
        <div class="block__flex-column">
            <p>
                Мемоизация части поддерева шаблона. 
                Может использоваться как для элементов, так и для компонентов. 
                Директива ожидает массив фиксированной длины зависимых значений, 
                которые станут использоваться для сравнения при мемоизации. 
                Если каждое значение массива осталось таким же, как при последней 
                отрисовке, то обновление всего поддерева будет пропущено. Например:
            </p>
            <ul>
                <h4>Вывод:</h4>
                <li>
                    v-memo нужна исключительно для микрооптимизации сценариев, 
                    где критически важна производительность, и должна использоваться 
                    крайне редко. Наиболее частый случай, где она может оказаться 
                    полезной — отрисовка больших списков с помощью v-for (когда length > 1000).
                </li>
                <li>
                    v-memo также можно использовать и на компонентах, чтобы вручную 
                    предотвращать нежелательные обновления в некоторых крайних случаях, 
                    когда проверка обновления дочернего компонента была де-оптимизирована. 
                    Но, повторимся, на разработчике лежит полная ответственность за указание 
                    правильного массива зависимостей, для избежания пропуска необходимых обновлений.
                    <p><strong> СМОТРИ раздел "Продвинутые вопросы !" </strong></p>
                </li>
            </ul>
        </div>
    </div>
</template>

<script>

    export default {
        name: 'VDirectiveVMemo',
        data(){
            return {}
        },
        components: {},
        props: [], 
        computed: {}
    }
    
</script>

<style scoped lang="scss">

</style>