<template>
        <div class="block__solution">
        <h4>10) Directive: <span>v-model</span></h4>
        <div class="block__flex-column">
            <p>Создаёт двухстороннюю привязку к элементу ввода формы или к компоненту.</p>
            <ul>
                <h4>Используется с: </h4>
                <li>input</li>
                <li>select</li>
                <li>textarea</li>
            </ul>
            <ul>
                <h4>Модификаторы:</h4>
                <li>.lazy — отслеживание события change вместо input</li>
                <li>.number — приведение корректной строки со значением к числу</li>
                <li>.trim —  удаление пробелов в начале и в конце строки</li>
            </ul>
                            <ul>
                <h4>Вывод:</h4>
                <li>
                    Обычное использование. Можно использовать директиву v-model 
                    для создания двусторонней привязки данных с элементами форм: input, 
                    textarea и select. Она автоматически выбирает правильный способ 
                    обновления элемента в зависимости от его типа. Хоть v-model и 
                    выглядит как некая магия, по сути это лишь синтаксический сахар 
                    для обновления данных при вводе пользователем, плюс небольшие 
                    доработки для некоторых граничных случаев.
                </li>
                <li>
                    v-model игнорирует начальное значение атрибутов value, 
                    checked или selected на любых элементах форм. Источником 
                    истины всегда считаются данные текущего активного экземпляра. 
                    Начальное значение нужно объявить на стороне JavaScript, 
                    внутри опции data компонента.
                </li>
                <li>
                    Внутренне v-model использует разные свойства и генерирует 
                    разные события для различных элементов форм:
                    <ol>
                        <li>элементы для ввода текста и многострочного текста используют свойство value и событие input</li>
                        <li>чекбоксы и радиокнопки используют свойство checked и событие change;</li>
                        <li>выпадающие списки используют свойство value и событие change.</li>
                    </ol>
                </li>
                <li>Интерполяция внутри textarea не работают. Используйте директиву v-model вместо неё.</li>
                <li>
                    При использовании v-model на компоненте по умолчанию используется входной параметр 
                    modelValue и событие update:modelValue. Их можно изменить через аргумент v-model.
                    <span>v-model:name="updateName"</span>.
                    <p><strong>СМОТРИ раздел "Продвинутые вопросы !"</strong></p>
                </li>
            </ul>
        </div>
    </div>
</template>

<script>
    export default {
        name: 'VDirectiveVModel',
        data(){
            return {}
        },
        components: {},
        props: [], 
        computed: {}
    }
</script>

<style scoped lang="scss">

</style>